mwg.wb.pkg.promotion/soapxml/GetPromotionBHXByProductID.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <AuthenSoapHeader xmlns="http://tempuri.org/">
      <GUID>string</GUID>
      <AuthenData>{AuthenData}</AuthenData>
      <DelegatingUser>string</DelegatingUser>
      <LanguageID>1</LanguageID>
      <ModuleID>1</ModuleID>
    </AuthenSoapHeader>
  </soap:Header>
  <soap:Body>
    <GetPromotionBHXByProductID xmlns="http://tempuri.org/">
      <strProductID>{strProductID}</strProductID>
      <intQuantity>{intQuantity}</intQuantity>
      <intStoreID>{intStoreID}</intStoreID>
      <bolIsGetStock>{bolIsGetStock}</bolIsGetStock>
      <intOldDays>{intOldDays}</intOldDays>
    </GetPromotionBHXByProductID>
  </soap:Body>
</soap:Envelope>